In [2]:
import pandas as pd

In [11]:
employees = pd.read_excel("../Ex_Files_ETL_Python_SQL/Exercise Files/Chapter_2/H+ Sport Employees.xlsx", sheet_name='Employees-Table')

In [12]:
employees.head()

,Employee Name,Building,Department,Status,Hire Date,Month,Years,Benefits,Salary,Job Rating,New Salary,Tax Rate,2.91%
0,"Page, Lisa",West,ADC,Full Time,1999-01-11,Jan,25,DMR,24550,1,NaN,NaN,NaN
1,"Taylor, Hector",West,ADC,Half-Time,2011-02-21,Feb,12,DM,26795,4,NaN,NaN,NaN
2,"Dawson, Jonathan",West,ADC,Contract,2007-03-06,Mar,16,NaN,42540,5,NaN,NaN,NaN
3,"Duran, Brian",Taft,ADC,Hourly,2012-08-30,Aug,11,NaN,35680,2,NaN,NaN,NaN
4,"Weber, Larry",Watson,ADC,Full Time,2007-12-31,Dec,16,M,72830,2,NaN,NaN,NaN

In [13]:
transformed_employees = employees.drop(['Job Rating', 'New Salary', 'Tax Rate', '2.91%'], axis='columns')

In [15]:
transformed_employees.head()

,Employee Name,Building,Department,Status,Hire Date,Month,Years,Benefits,Salary
0,"Page, Lisa",West,ADC,Full Time,1999-01-11,Jan,25,DMR,24550
1,"Taylor, Hector",West,ADC,Half-Time,2011-02-21,Feb,12,DM,26795
2,"Dawson, Jonathan",West,ADC,Contract,2007-03-06,Mar,16,NaN,42540
3,"Duran, Brian",Taft,ADC,Hourly,2012-08-30,Aug,11,NaN,35680
4,"Weber, Larry",Watson,ADC,Full Time,2007-12-31,Dec,16,M,72830